Repository: Wege0921/ecommerce_app
Catalog: lib/l10n/app_*.arb
Languages: am

# appTitle
source: E-Commerce App
am: የንግድ መተግበሪያ

source: Home
am: መነሻ

source: Categories
am: ምድቦች

source: Cart
am: ጋሪ

source: Profile
am: መገለጫ

# loginTitle
source: Login
am: ይግቡ

# registerTitle
source: Register
am: ይመዝገቡ

source: Phone Number
am: ስልክ ቁጥር

# pinLabel
source: PIN (4-6 digits)
am: ፒን (6 አሃዞች)

# loginBtn
source: Login
am: ግባ

# registerBtn
source: Register
am: ተመዝገብ

# rememberBiometric
source: Remember for biometric login
am: ለባዮሜትሪክ መግባት አስታውስ

source: View Details
am: ዝርዝሮች ይመልከቱ

source: My Orders
am: ትዕዛዞቼ

source: Refresh
am: አድስ

# productsTitle
source: Products
am: ምርቶች

# noProducts
source: No products yet
am: ምንም ምርት የለም

# noOrders
source: No orders yet
am: ምንም ትዕዛዝ የለም

source: Password
am: የይለፍ ቃል

source: Confirm Password
am: የይለፍ ቃል አረጋግጥ

# loginSuccess
source: Login successful!
am: ተሳክቷል!

# loginFailed
source: Login failed. Please check your credentials.
am: መግባት አልተሳካም። እባክዎን መረጃዎን ያረጋግጡ።

# registrationSuccess
source: Registration successful! Please login.
am: ምዝገባው ተሳክቷል! እባክዎን ይግቡ።

source: Registration failed.
am: ምዝገባው አልተሳካም።

# fillAllFields
source: Please fill all fields.
am: እባክዎን ሁሉንም መሙያዎች ይሙሉ።

# invalidPhone
source: Enter a valid Ethio (9...) or Safaricom (7...) phone number.
am: ትክክለኛ የኢትዮ ወይም ሳፋሪኮም ስልክ ቁጥር ያስገቡ።

# passwordsDontMatch
source: Passwords do not match.
am: የይለፍ ቃሎቹ አይመሳሰሉም።

# biometricNotSupported
source: Biometric not supported on this device.
am: ባዮሜትሪክ በዚህ መሣሪያ አይደገፍም።

# biometricNoSavedCreds
source: No saved credentials. Login once and enable remember option.
am: የተቀመጡ መረጃዎች የሉም። አንድ ጊዜ ይግቡ እና አስታውስ ይምረጡ።

source: Authenticate to login
am: ለመግባት ያረጋግጡ

source: Biometric login failed.
am: ባዮሜትሪክ መግባት ተስኖ አልተሳካም።

# biometricError
source: Biometric error: {error}
am: የባዮሜትሪክ ስህተት፡ {error}

# enterPinTitle
source: Enter PIN
am: ፒን አስገባ

# confirmPinTitle
source: Confirm PIN
am: ፒን አረጋግጥ

# enterPinSubtitle
source: Please enter your 6-digit PIN
am: እባክዎ 6-አሃዶ ፒንዎን አስገቡ

# confirmPinSubtitle
source: Re-enter the same 6-digit PIN to confirm
am: ያስገቡትን 6-አሃዶ ፒን እንደገና ያረጋግጡ

# nextLabel
source: Next
am: ቀጣይ

# clearLabel
source: Clear
am: አጥፋ

# deleteLabel
source: Delete
am: ሰርዝ

# pinMismatch
source: PINs do not match
am: ፒኖቹ አይመሳሰሉም

source: Forgot PIN?
am: ፒን ረሱ?

# forgotPinTitle
source: Recover PIN
am: ፒን አድስ

# forgotPinSubtitle
source: Enter your phone number, then set a new 6-digit PIN after verification.
am: ስልክ ቁጥርዎን አስገቡ፣ ከማረጋገጥ በኋላ አዲስ 6-አሃዶ ፒን ያስቀምጡ።

# continueLabel
source: Continue
am: ቀጣይ

# featureUnavailable
source: This feature requires a backend endpoint to reset PIN.
am: ይህ ባህሪ የፒን ማስተካከያ ኤፒአይ ይፈልጋል።

# forgotPinSuccess
source: PIN reset successfully. You can now login with the new PIN.
am: ፒን ተስተካክሏል። አሁን በአዲሱ ፒን መግባት ትችላለህ/ትችላለች.

# forgotPinFailed
source: Failed to reset PIN. Please try again.
am: ፒን ማድስ አልተሳካም። እባክዎ እንደገና ይሞክሩ።

source: Add to Cart
am: ወደ ጋሪ ያክሉ

source: Buy Now
am: አሁን ይግዙ

source: Quantity
am: ብዛት

source: Price
am: ዋጋ

# categoryEyeGlasses
source: Eyewear
am: የዓይን መነጽሮች

# categoryCosmetics
source: Cosmetics
am: ኮስሜቲክስ

# categoryMen
source: Men
am: የወንዶች

# categoryFemale
source: Female
am: የሴቶች

# categoryKids
source: Kids
am: የህፃናት

# categoryElectronics
source: Electronics
am: ኤሌክትሮኒክስ

# categoryComputer
source: Computer
am: ኮምፒዩተር

# categoryAccessories
source: Accessories
am: አክሰሰሪዎች

source: Welcome back
am: እንኳን በደህና ተመለሱ

# createAccount
source: Create your account
am: መለያ ፍጠር

# checkoutTitle
source: Checkout
am: ወደ ክፍያ

# cartEmpty
source: Your cart is empty
am: ጋሪዎ ባዶ ነው

source: Shipping Details
am: የመላኪያ ዝርዝሮች

source: Full Name
am: ሙሉ ስም

source: Delivery Address
am: የመላኪያ አድራሻ

# requiredField
source: Required
am: አስፈላጊ ነው

source: Payment Instructions
am: የክፍያ መመሪያ

# paymentInstructionLine
source: Please pay using Tele birr and upload a screenshot of your payment.
am: እባክዎ በቴሌ ብር ይክፈሉ እና የክፍያ ስክሪንሹት ያስገቡ።

# bankTransfer
source: Bank Transfer (upload screenshot)
am: ባንክ ትራንስፈር (ስክሪንሹት ያስገቡ)

source: Cash on delivery
am: በመላኪያ ጊዜ ክፍያ

source: Upload Payment Screenshot
am: የክፍያ ስክሪንሹት አስገባ

source: Change Screenshot
am: ስክሪንሹት ቀይር

source: Payment Method
am: የክፍያ መንገድ

source: Order Summary
am: የትዕዛዝ ማጠቃለያ

source: Subtotal
am: ጠቅላላ

source: Placing...
am: በመስጠት ላይ...

source: Place Order
am: ትዕዛዝ ስጥ

# uploadProofRequired
source: Please upload the payment screenshot.
am: እባክዎ የክፍያ ስክሪንሹት ያስገቡ።

# orderPlaced
source: Order placed successfully
am: ትዕዛዙ ተሳክቷል

# orderFailed
source: Failed to place order: {error}
am: ትዕዛዙ አልተሳካም፡ {error}

source: Total
am: ጠቅላላ

# telebirr
source: Tele birr: +251 910993144
am: ቴሌ ብር፡ +251 910993144
